package ffc.airsync.api.genogram

enum class JhcisFamilyPosition(val value: Char) {
    `อื่นๆ(บุตรบุญธรรมคนรับใช้)`('0'),
    `หัวหน้าครอบครัว`('1'),
    `คู่สมรส(ของ หนครอบครัว)`('2'),
    `บุตร`('3'),
    `บุตร(ของ หนครอบครัว)`('4'),
    `บุตร(ของ คู่สมรส)`('5'),
    `บิดา(ของ หนครอบครัว)`('6'),
    `มารดา(ของ หนครอบครัว)`('7'),
    `บิดา(ของ คู่สมรส)`('8'),
    `มารดา(ของ คู่สมรส)`('9'),
    `ลุง(ของ หนครอบครัว)`('a'),
    `ป้า(ของ หนครอบครัว)`('b'),
    `น้า(ของ หนครอบครัว)`('c'),
    `อา(ของ หนครอบครัว)`('d'),
    `ลุง(ของ คู่สมรส)`('e'),
    `ป้า(ของ คู่สมรส)`('f'),
    `น้า(ของ คู่สมรส)`('g'),
    `อา(ของ คู่สมรส)`('h'),
    `ปู่(ของ หนครอบครัว)`('i'),
    `ย่า(ของ หนครอบครัว)`('j'),
    `ตา(ของ หนครอบครัว)`('k'),
    `ยาย(ของ หนครอบครัว)`('l'),
    `ปู่(ของ คู่สมรส)`('m'),
    `ย่า(ของ คู่สมรส)`('n'),
    `ตา(ของ คู่สมรส)`('o'),
    `ยาย(ของ คู่สมรส)`('p'),
    `ปู่ทวด(ของ หนครอบครัว)`('q'),
    `ย่าทวด(ของ หนครอบครัว)`('r'),
    `ตาทวด(ของ หนครอบครัว)`('s'),
    `ยายทวด(ของ หนครอบครัว)`('t'),
    `ปู่ทวด(ของ คู่สมรส)`('u'),
    `ย่าทวด(ของ คู่สมรส)`('v'),
    `ตาทวด(ของ คู่สมรส)`('w'),
    `ยายทวด(ของ คู่สมรส)`('x'),
    `พี่(ของ หนครอบครัว)`('ก'),
    `น้อง(ของ หนครอบครัว)`('ข'),
    `พี่(ของ คู่สมรส)`('ค'),
    `น้อง(ของ คู่สมรส)`('ง'),
    `หลาน`('จ'),
    `หลาน(ของ หนครอบครัว)`('ฉ'),
    `หลาน(ของ คู่สมรส)`('ช'),
    `เหลน`('ซ'),
    `เหลน(ของ หนครอบครัว)`('ฌ'),
    `เหลน(ของ คู่สมรส)`('ญ'),
    `โหลน`('ฎ'),
    `โหลน(ของ หนครอบครัว)`('ฏ'),
    `โหลน(ของ คู่สมรส)`('ฐ'),
    `บุตรสะใภ้`('ฑ'),
    `บุตรเขย`('ฒ');

    companion object {
        fun valueOf(value: Char): JhcisFamilyPosition? {
            return values().find { it.value == value }
        }
    }
}
